app/controllers/records_controller.rb

  def index
    @records = Record.all.with_attached_file
---
SELECT "records".* FROM "records"

  def create
    @record = Record.new(record_params)

    respond_to do |format|
      if @record.save
---
INSERT INTO "records" ("awbnum", "created_at", "updated_at") VALUES (?, ?, ?)  [["awbnum", "123123"], ["created_at", "2019-01-14 07:01:32.710056"], ["updated_at", "2019-01-14 07:01:32.710056"]]

  def update
    respond_to do |format|
      if @record.update(record_params)
---
UPDATE "records" SET "awbnum" = ?, "doc" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["awbnum", "03103303"], ["doc", "807-03103303.png"], ["updated_at", "2019-01-29 08:46:42.500220"], ["id", 48]]

  def destroy
    @record.destroy
---
DELETE FROM "records" WHERE "records"."id" = ?  [["id", 12]]

  def batch_download
    ids = params["record"].to_unsafe_h.map(&:first)

    if ids.present?
      folder_path = "#{Rails.root}/public/downloads/"
      zipfile_name = "#{Rails.root}/public/archive.zip"

      FileUtils.remove_dir(folder_path) if Dir.exist?(folder_path)
      FileUtils.remove_entry(zipfile_name) if File.exist?(zipfile_name)
      Dir.mkdir("#{Rails.root}/public/downloads")

      Record.where(id: ids).each do |attachment|
---
SELECT "records".* FROM "records" WHERE "records"."id" = ?  [["id", 20]]