app/controllers/records_controller.rb

UPDATE "records" SET "updated_at" = ? WHERE "records"."id" = ?  [["updated_at", "2019-01-10 11:14:08.832870"], ["id", 17]]
---
  def update
    respond_to do |format|
      if @record.update(record_params)