app/controllers/trip_files_controller.rb

SELECT "trip_files".* FROM "trip_files"
---
  def index
    @trip_files = TripFile.all

INSERT INTO "trip_files" ("flight", "flight_number", "doc", "created_at", "updated_at", "date") VALUES (?, ?, ?, ?, ?, ?)  [["flight", "AK"], ["flight_number", "200"], ["doc", "AK-200_27/07/2019.png"], ["created_at", "2019-07-29 11:16:56.411483"], ["updated_at", "2019-07-29 11:16:56.411483"], ["date", "27/07/2019"]]
---
  def create
    @trip_file = TripFile.new(trip_file_params)

    respond_to do |format|
      if @trip_file.save

DELETE FROM "trip_files" WHERE "trip_files"."id" = ?  [["id", 1]]
---
  def destroy
    @trip_file.destroy

SELECT  "trip_files".* FROM "trip_files" WHERE "trip_files"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_trip_file
      @trip_file = TripFile.find(params[:id])